Repository: winny-/utimer
Catalog: po/*.po
Languages: fr

source: Error during setting current locale. Falling back to default locale.
fr: Erreur durant le choix de la locale. Retour sur la locale par défaut.

source: Couldn't set any locale. Exiting...
fr: Impossible de définir une locale. Arrêt en cours...

source: Report any bug to: bugs@utimer.codealpha.netor https://bugs.launchpad.net/utimer
fr: En cas de bugs, envoyez un mail à : bugs@utimer.codealpha.net ou allez sur https://bugs.launchpad.net/utimer

source: Option parsing failed: %s
fr: Echec de l'intrepretation de l'option : %s

source: No option specified! Use "-t TIMELENGTH" if you wish to use the the timer. To see the usage help, type: utimer --help
fr: Aucune option n'a été spécifée! Utilisez "-t TIMELENGTH" si vous souhaitez utiliser le timer. Pour afficher l'aide d'utilisation, entrez: utimer --help

source: This is a list of the possible limits of µTimer for your machine.
fr: Ceci est la liste des limites possibles de µTimer pour cette machine.

source: * Limits for the Timer:
fr: * Limites du timer:

source: - The maximum possible timer length is: %s.
fr: - La durée maximum du timer est : %s.

source: If you enter a value that is exceeding it, it will be replaced by the value above.
fr: Si vous saisissez une valeur plus grande, elle sera remplacée par la valeur ci-dessus.

source: - This program is not Year-2038-bug safe (on a 32 bits machine)!
fr: - Ce programme est vulnérable au bogue de l'an 2038 (sur une machine 32 bits) !

source: Timer will exit after reaching: %s
fr: Le timer se terminera aprés avoir atteint : %s

source: Thread failed: %s
fr: Echec du thread : %s

source: command-line "timer" which features a timer, a countdown and a stopwatch
fr: "timer" en ligne de commande qui fournit un timer, un compte à rebours et un chronomètre

source: µTimer (or "utimer", pronounced as "micro-timer") is a multifunction timer (command-line only). The main features are: - a timer (e.g. count from 0 to 4 minutes), - a countdown (e.g. count from 10 minutes to 0), - a stopwatch. µTimer always exits after the timer or countdown are done unless specified otherwise. This can be useful for using countdowns in scripts, for example. The stopwatch, which is not concerned, needs to be stopped manually using 'ctrl+c' or 'q'.
fr: µTimer (ou "utimer", prononcé "micro-timer") est un timer multifonction (ligne de commande uniquement). Les principales fonctions sont - un timer (ex. compter de 0 à 4 minutes), - un compte à rebours (ex. compter de 10 minutes à 0 minutes), - un chronomètre. µTimer se ferme toujours après que le timer ou le compte à rebours ont écoulé à moins du contraire spécifié par une option. Ceci peut être utile, par exemple, pour définir un compte à rebours pour des scripts. Le chronomètre n'est pas concerné par cette particularité. Il a besoin d'être arrêté manuellement en appuyant sur 'ctrl+c' ou 'q'.

source: Verbose output
fr: Sortie verbeuse

source: Display the current version of µTimer.
fr: Affiche la version actuelle de µTimer.

source: Debug output (use only for debugging purposes or for bug reports)
fr: Sortie de débuggage (à utiliser uniquement pour débugger ou pour des rapports de bug)

source: Timer mode: the program will exit after a certain TIMELENGTH (e.g. utimer -t 5d18h31m27s300ms).
fr: Mode Timer : le programme se fermera après une certaine PERIODEDETEMPS (ex: utimer -t 5d18h31m27s300ms).

source: TIMELENGTH
fr: PERIODEDETEMPS

source: Show the limits of µTimer (Maximum time length, Year 2038 bug, etc...)
fr: Affiche les limites de µTimer (Période de temps maximum, bogue de l'an 2038, etc...)

source: When (and only when) the user hits the 'q' key to end the program, the program will exit with a SUCCESS (0) exit status instead of a non-zero/error (1) exit status (this might be useful for developers).
fr: Quand (et seulement quand) l'utilisateur appuie sur la touche 'q' afin de terminer le programme, le programe va se fermer en retournant un code de sortie (0) signifiant un SUCCES au lieu d'un code de sortie non-nul signifiant une ERREUR (1) (ceci peut être utile pour les développeurs).

source: Elapsed Time: %s
fr: Temps écoulé : %s

source: Possible overflow! (is it Year 2038 bug?). The start time is after the current time!
fr: Dépassement de mémoire possible ! (Est-ce le bug de l'an 2038 ?). L'heure de lancement est postérieure à l'heure actuelle.

source: IMPORTANT: The timer will continue normally but the time displayed (elapsed time) may be invalid.
fr: IMPORTANT: le timer va continuer de fonctionner normalement mais le temps affiché (temps écoulé) risque d'être incorrect.

source: %s doesn't support given unit (%d).
fr: %s ne supporte pas l'unité spécifiée (%d).

source: The last number is too big. It has been changed into: %lu
fr: Le dernier nombre est trop grand. Il a été remplacé par : %lu

source: The number before '%s' is too big. It has been changed into: %lu
fr: Le nombre situé avant '%s' est trop grand. Il a été remplacé par : %lu

source: Error when trying to parse: %s
fr: Erreur en tentant d'interpréter : %s

# NUMDAYS days HOURS:MINUTES:SECONDS:MILLISECONDS (SECONDS.MILLISECONDS seconds)
source: %i days %02i:%02i:%02lu.%03lu (%lu.%03lu seconds)
fr: %i jours %02i:%02i:%02lu.%03lu (%lu.%03lu secondes)

source: No digits were found
fr: Aucun chiffre n'a été trouvé

source: Remaining characters after number: %s
fr: Des caractères sont restants après le nombre: %s

source: ** WARNING: %s
fr: ** ATTENTION: %s
